{
  "backend/main.mo": "Motoko canister defining restaurants, menu items, user profiles, and orders with authorization checks and basic query endpoints for profiles and restaurant browsing.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, and test IDs for authentication, restaurant browsing, ordering, and tracking.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all major frontend files including components, hooks, pages, and styling.",
  "frontend/index.css": "Tailwind base/theme configuration defining OKLCH color tokens and dark mode variables for the app’s visual design.",
  "frontend/index.html": "Minimal HTML shell containing a root div and script loader for the React application.",
  "frontend/src/App.tsx": "Main React app wiring up routing, authentication state, profile setup flow, layout wrapper, and protected routes for orders.",
  "frontend/src/cart/CartContext.tsx": "React context managing cart items with add/remove/update/clear operations and localStorage persistence.",
  "frontend/src/cart/cartTypes.ts": "TypeScript interfaces defining the UI-layer structure of cart items.",
  "frontend/src/components/auth/AuthButton.tsx": "Login/logout button handling Internet Identity authentication and clearing query cache on logout.",
  "frontend/src/components/auth/RequireAuth.tsx": "Displays a login prompt using Internet Identity when the user is unauthenticated; otherwise renders children.",
  "frontend/src/components/common/QueryState.tsx": "Provides loading skeletons, error alerts, and empty state UI components for query results.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header navigation, cart badge, auth button, content area, and footer.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Shows a modal prompting the user to enter their name and saves the profile using a mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity, reinitializing on identity change and invalidating dependent queries.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches and updates the current user's profile using actor-based queries and mutations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login state, exposes identity and login actions, and provides a context provider setup.",
  "frontend/src/hooks/useOrderDetail.ts": "Fetches order status and order items for a given orderId using the backend actor.",
  "frontend/src/hooks/useOrders.ts": "Fetches a list of the caller's orders, currently returning an empty array as the backend lacks implementation.",
  "frontend/src/hooks/usePlaceOrder.ts": "Creates a mutation to place an order and invalidates order-related queries on success.",
  "frontend/src/hooks/useRestaurant.ts": "Fetches restaurant details and menu items for a given restaurantId via the backend actor.",
  "frontend/src/hooks/useRestaurants.ts": "Retrieves a list of all restaurants using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for theming, including light and dark mode color tokens.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it in InternetIdentityProvider and React Query client setup.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart UI, handles quantity updates, item removal, authentication checks, and order placement.",
  "frontend/src/pages/OrderDetailPage.tsx": "Fetches and displays order status and items, with loading, error, refresh, and navigation controls.",
  "frontend/src/pages/OrdersListPage.tsx": "Displays a list of the user's past orders with status, total amount, and navigation to order details.",
  "frontend/src/pages/RestaurantDetailPage.tsx": "Shows restaurant details and menu items, manages per-item quantities, and handles adding items to the cart.",
  "frontend/src/pages/RestaurantsListPage.tsx": "Lists all available restaurants with navigation to each restaurant's detail page.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, extended theme settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing a food ordering system with existing implemented features and pending feature requests, including authentication, browsing, ordering, and tracking."
}