{
  "backend/main.mo": "Main Motoko canister defining restaurants, menu items, orders, user profiles, seeded data, and authorization mixin setup.",
  "backend/migration.mo": "Migration module that rewrites specific South Indian menu item image URLs while preserving other fields.",
  "feature_evidence.json": "Feature evidence report listing three frontend image‑handling features, their file impacts, test IDs, and component dependencies.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files, including components, hooks, pages, and styling utilities.",
  "frontend/index.css": "Tailwind CSS base/theme variables defining color tokens and dark mode overrides for the app’s UI.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring routes, authentication handling, layout, and profile‑setup gating.",
  "frontend/src/cart/CartContext.tsx": "React context managing cart state with add/remove/update operations and localStorage persistence.",
  "frontend/src/cart/cartTypes.ts": "Type definitions for cart item structures used in the UI.",
  "frontend/src/components/auth/AuthButton.tsx": "Provides a button that handles Internet Identity login and logout, updating React Query cache accordingly.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps protected content and shows a login prompt card when the user is not authenticated.",
  "frontend/src/components/common/ImageWithFallback.tsx": "Renders an image with automatic fallback handling if the source fails to load.",
  "frontend/src/components/common/QueryState.tsx": "Exports common UI components for loading skeletons, error messages, and empty states.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main application layout with header navigation, cart badge, auth button, and footer.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Displays a dialog for new users to enter and save their name using a profile mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the current identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks to fetch and update the authenticated user's profile via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context with login, logout, and identity management using Dfinity AuthClient.",
  "frontend/src/hooks/useOrderDetail.ts": "Contains hooks to fetch order status and items for a given order ID from the backend.",
  "frontend/src/hooks/useOrders.ts": "Defines a hook to list orders for the current user, currently returning an empty list placeholder.",
  "frontend/src/hooks/usePlaceOrder.ts": "Provides a mutation hook to place an order and invalidate order-related queries afterward.",
  "frontend/src/hooks/useRestaurant.ts": "Exposes hooks to fetch restaurant details and menu data by restaurant ID.",
  "frontend/src/hooks/useRestaurants.ts": "Offers a hook to list all restaurants using the backend actor.",
  "frontend/src/index.css": "Configures Tailwind base styles, theming variables, and a global background image.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/CartPage.tsx": "Implements the shopping cart page with item management and order placement logic.",
  "frontend/src/pages/OrderDetailPage.tsx": "Displays detailed order status and items with refresh and error handling.",
  "frontend/src/pages/OrdersListPage.tsx": "Shows a list of the user's orders with navigation to order details.",
  "frontend/src/pages/RestaurantDetailPage.tsx": "Renders restaurant details and menu items with add‑to‑cart functionality.",
  "frontend/src/pages/RestaurantsListPage.tsx": "Lists available restaurants with navigation to their detail pages.",
  "frontend/src/utils/imageFallbacks.ts": "Provides fallback image mappings and name normalization for dishes and restaurants.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL and hash parameters, persisting them in sessionStorage, and clearing stored or hash-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Snapshot of project metadata including architecture notes, known issues, image requirements, and generated asset information."
}