{
  "backend/main.mo": "Motoko canister defining restaurant, menu, order, and profile types with seeded Sakthi Snacks data and authorization-protected query endpoints.",
  "feature_evidence.json": "Feature evidence report describing implemented features, affected files, components, and related test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files covering routing, hooks, components, pages, and cart logic.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling.",
  "frontend/index.html": "Simple HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router configuration and app root handling layout, routes, authentication, and profile setup modal.",
  "frontend/src/cart/CartContext.tsx": "React context managing cart state with localStorage persistence and item operations.",
  "frontend/src/cart/cartTypes.ts": "Type definitions for cart item structures used in the UI.",
  "frontend/src/components/auth/AuthButton.tsx": "Login/logout button integrating Internet Identity and React Query cache clearing.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper component blocking access to protected content unless the user is authenticated.",
  "frontend/src/components/common/AppErrorBoundary.tsx": "React error boundary that catches runtime errors and shows a recovery UI with reset and refresh options.",
  "frontend/src/components/common/ImageWithFallback.tsx": "Image component that swaps to a fallback image on load failure and resets when src changes.",
  "frontend/src/components/common/QueryState.tsx": "Provides loading skeletons, error alerts, and empty state UI components for data queries.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header navigation, cart indicator, footer, and content container.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog prompting users to enter their name and save their profile via mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks to fetch and save the current user's profile using the actor API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity provider and hook managing authentication state, login, and stored identities.",
  "frontend/src/hooks/useOrderDetail.ts": "Hooks to load order status and order items from the backend using an order ID.",
  "frontend/src/hooks/useOrders.ts": "Fetches the authenticated user's orders, currently returning an empty list until backend support exists.",
  "frontend/src/hooks/usePlaceOrder.ts": "Mutation hook to place an order and invalidate order-related queries on success.",
  "frontend/src/hooks/useRestaurant.ts": "Hooks to fetch a restaurant and its menu from the backend by restaurant ID.",
  "frontend/src/hooks/useRestaurants.ts": "Fetches and returns a list of all restaurants from the backend.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining color themes plus global background styling.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, identity provider, and global styles.",
  "frontend/src/pages/CartPage.tsx": "Handles cart display, item quantity updates, and checkout flow including authentication and order placement.",
  "frontend/src/pages/OrderDetailPage.tsx": "Fetches and displays order status and items with refresh, loading, and error states.",
  "frontend/src/pages/OrdersListPage.tsx": "Lists the user's past orders with status, total amount, and navigation to order details.",
  "frontend/src/pages/RestaurantDetailPage.tsx": "Shows restaurant details and menu items, supports adding items to cart with quantity controls and validations.",
  "frontend/src/pages/RestaurantsListPage.tsx": "Displays a grid of restaurants with images and descriptions, allowing navigation to each restaurant's menu.",
  "frontend/src/utils/formatCurrency.ts": "Formats numbers or BigInts into INR currency strings.",
  "frontend/src/utils/getErrorMessage.ts": "Extracts a human-readable message from various error types safely.",
  "frontend/src/utils/imageFallbacks.ts": "Defines fallback image paths and a large dish-name-to-image map pointing menu item names to generated asset filenames.",
  "frontend/src/utils/restaurantId.ts": "Parses a restaurant ID string into a positive bigint and returns either a valid ID or an error message.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and manage hash-based query values.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, colors, animations, and plugins for the frontend.",
  "project_state.json": "Tracks project state, issues, image requirements, and feature requests for updating Sakthi Snacks image assets."
}