{
  "backend/main.mo": "Motoko canister with authorization mixin, seeded restaurants and menu data, and type definitions and state maps for restaurants, menu items, orders, users, and carts.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, and test IDs for the Sakthi Snacks image‑correction work.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of major frontend React files including pages, hooks, components, and cart logic.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base style rules for the app.",
  "frontend/index.html": "HTML entry point that loads the root element and bootstraps the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React router setup with routes, layout, authentication checks, and profile‑setup gating for the application.",
  "frontend/src/cart/CartContext.tsx": "React context managing cart items with localStorage persistence and operations for add, remove, update, and clear.",
  "frontend/src/cart/cartTypes.ts": "Type definitions for cart items including IDs, pricing, quantities, and restaurant metadata.",
  "frontend/src/components/auth/AuthButton.tsx": "Login/logout button handling Internet Identity authentication and clearing React Query cache on logout.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper component blocking access to protected pages and showing a login prompt when unauthenticated.",
  "frontend/src/components/common/AppErrorBoundary.tsx": "React error boundary that catches rendering errors and displays a styled fallback UI with reset and refresh options.",
  "frontend/src/components/common/ImageWithFallback.tsx": "Image component that swaps to a fallback source on load failure and resets when the src changes.",
  "frontend/src/components/common/QueryState.tsx": "Provides loading skeletons, error alerts, and empty-state UI components for query results.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header navigation, cart indicator, footer, and content container.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog prompting the user to submit their name and save their profile via a mutation.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor based on identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks to fetch and save the current user's profile using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and auth client setup.",
  "frontend/src/hooks/useOrderDetail.ts": "Hooks to fetch order status and order items for a given order ID.",
  "frontend/src/hooks/useOrders.ts": "Hook to list the caller's orders; currently returns an empty array as a placeholder.",
  "frontend/src/hooks/usePlaceOrder.ts": "Mutation hook that submits a new order and invalidates the orders query on success.",
  "frontend/src/hooks/useRestaurant.ts": "Hooks to fetch a restaurant and its menu based on a restaurant ID.",
  "frontend/src/hooks/useRestaurants.ts": "Hook that fetches the list of restaurants from the backend actor.",
  "frontend/src/index.css": "Tailwind setup defining theme variables, dark mode styles, and global background styling.",
  "frontend/src/main.tsx": "Entrypoint that mounts the app with React Query and Internet Identity providers.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart, manages item quantity, handles checkout, and triggers order placement with authentication checks.",
  "frontend/src/pages/OrderDetailPage.tsx": "Fetches and displays order status and items, with loading, error handling, and manual refresh support.",
  "frontend/src/pages/OrdersListPage.tsx": "Lists the user's past orders with basic info and navigation to detailed order pages.",
  "frontend/src/pages/RestaurantDetailPage.tsx": "Shows a restaurant’s details and menu, validates IDs, and allows adding items to the cart with quantity controls.",
  "frontend/src/pages/RestaurantsListPage.tsx": "Displays a grid of restaurants with images and descriptions, handling loading, errors, and navigation to details.",
  "frontend/src/utils/formatCurrency.ts": "Converts minor-unit numeric prices into formatted INR currency strings.",
  "frontend/src/utils/getErrorMessage.ts": "Extracts a safe, user-friendly message from unknown error values.",
  "frontend/src/utils/imageFallbacks.ts": "Defines fallback image paths and a large name-to-image mapping for restaurant and dish images.",
  "frontend/src/utils/restaurantId.ts": "Parses and validates restaurant ID strings into positive bigint values.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based params.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugins.",
  "project_state.json": "Tracks project state, issues, and feature requests related to correcting mismatched Sakthi Snacks images."
}