{
  "kind": "build_request",
  "title": "Generate and wire up new Pizza Palace restaurant and menu item images",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-28",
      "text": "Add new static image assets for Pizza Palace (restaurant cover + its menu items) under `frontend/public/assets/generated/` using consistent `.dim_*` filenames, matching the existing generated-asset naming conventions used for other restaurants.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "same way generate the images for the pizza palace"
        ]
      },
      "acceptanceCriteria": [
        "The following new image files exist under `frontend/public/assets/generated/` with the exact filenames specified in Image Requirements.",
        "Each image is the correct dimension based on its filename suffix (1200x600 for the cover; 512x512 for dish images)."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Update centralized frontend image resolution so Pizza Palace (restaurant name \"Pizza Palace\") and its menu items (Margherita Pizza, Pepperoni Pizza, Hawaiian Pizza, Garlic Breadsticks, Caesar Salad) resolve to the newly generated static assets by name-based mapping, and are displayed consistently anywhere restaurant/menu images render.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "same way generate the images for the pizza palace"
        ]
      },
      "acceptanceCriteria": [
        "In the restaurants list and restaurant detail views, Pizza Palace uses the new Pizza Palace cover image.",
        "In the Pizza Palace restaurant detail view, each of the 5 Pizza Palace menu items displays its corresponding new dish image (not the generic dish fallback).",
        "Image resolution changes are made via the centralized helpers in `frontend/src/utils/imageFallbacks.ts` (no duplicate ad-hoc mapping elsewhere)."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Update backend seeded `imageUrl` values for Pizza Palace (restaurantId=2) and its menu items (menuItemIds 6–10) so a fresh deploy points directly to the new `/assets/generated/*.dim_*` static asset paths.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "same way generate the images for the pizza palace"
        ]
      },
      "acceptanceCriteria": [
        "`backend/main.mo` sets Pizza Palace restaurant `imageUrl` to the new cover asset path.",
        "`backend/main.mo` sets menuItemIds 6–10 `imageUrl` fields to the new dish asset paths.",
        "On a fresh deploy, listing restaurants and Pizza Palace menu items returns the updated `.dim_*` imageUrl values."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Extend the conditional Motoko state upgrade migration to update any existing persisted Pizza Palace restaurant/menu `imageUrl` values to the new `.dim_*` asset paths even when older/legacy values are already present.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "same way generate the images for the pizza palace"
        ]
      },
      "acceptanceCriteria": [
        "`backend/migration.mo` updates persisted records for restaurantId=2 and menuItemIds 6–10 to the new imageUrl values during upgrade.",
        "Upgrading an existing canister (with legacy Pizza Palace imageUrl values) results in the UI showing the new Pizza Palace images without requiring a fresh deploy."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be modified: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, `frontend/src/components/ui`.",
    "Backend must remain a single-actor Motoko canister with all business logic in `backend/main.mo`.",
    "Add/modify `backend/migration.mo` only as needed per the conditional migration policy."
  ],
  "nonGoals": [
    "Do not add new restaurants or new Pizza Palace menu items beyond the existing seeded items (menuItemIds 6–10).",
    "Do not implement real-time features, external storage, or third-party services for image hosting."
  ],
  "imageRequirements": {
    "required": [
      "Wide photo-realistic restaurant cover image featuring a pizza spread on a rustic table with warm lighting (restaurant-pizza-palace-cover.dim_1200x600.png)",
      "Square photo-realistic dish image of a Margherita pizza with basil leaves and melted mozzarella (dish-margherita-pizza.dim_512x512.png)",
      "Square photo-realistic dish image of a pepperoni pizza with crispy pepperoni slices and browned cheese (dish-pepperoni-pizza.dim_512x512.png)",
      "Square photo-realistic dish image of a Hawaiian pizza with pineapple chunks, ham, and melted cheese (dish-hawaiian-pizza.dim_512x512.png)",
      "Square photo-realistic dish image of garlic breadsticks with visible garlic-butter glaze and parmesan (dish-garlic-breadsticks.dim_512x512.png)",
      "Square photo-realistic dish image of a Caesar salad with romaine, croutons, parmesan shavings, and creamy dressing (dish-caesar-salad.dim_512x512.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}