{
  "kind": "build_request",
  "title": "Stop using dosa images as generic menu-item placeholders and ensure correct dish images app-wide",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-16",
      "text": "Update frontend dish image fallback behavior so non-dosa menu items never display the dosa image just because an image URL is missing/legacy; use a neutral generic dish fallback instead, and only show the dosa image when the dish name is actually \"Dosa\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "remove the dosa images from the menu items and replace with the perfect images all over the application"
        ]
      },
      "acceptanceCriteria": [
        "If a menu item has an unknown/missing/invalid imageUrl, the UI shows a generic dish placeholder (not dosa).",
        "Menu item cards in Restaurant Detail, cart items, and order detail views do not show dosa imagery unless the item name is Dosa (case-insensitive after normalization).",
        "The centralized dish image helper continues to be the single source of truth for dish image resolution across the app."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Refine the frontend legacy/invalid image URL detection in `frontend/src/utils/imageFallbacks.ts` so that valid existing static asset URLs are not incorrectly treated as legacy and forced to fall back to the generic placeholder (which previously caused dosa to appear widely).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "remove the dosa images from the menu items and replace with the perfect images all over the application"
        ]
      },
      "acceptanceCriteria": [
        "Restaurant and menu item images that already resolve to real files under `/assets/generated/` continue to display, even if they do not use the newer `.dim_*` naming scheme.",
        "Only known-bad/mismatched patterns (e.g., prior pizza placeholder patterns) are treated as legacy and re-resolved via name mapping/fallback.",
        "No widespread regression where many items revert to a single placeholder image due to overly broad legacy detection."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Update backend seeded `MenuItem.imageUrl` values for South Indian items so they point to the existing `.dim_*` generated assets (at minimum: Dosa, Idly, Vada, Vegetarian Meals, Non-Veg Meals, Chicken Chettinad, Chicken 65, Pepper Chicken, Mutton Kuzhambu/Chettinad Mutton Kuzhambu), and implement a conditional state upgrade migration to update persisted records to these corrected URLs on upgrade.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "remove the dosa images from the menu items and replace with the perfect images all over the application"
        ]
      },
      "acceptanceCriteria": [
        "Fresh deployments seed the South Indian menu items with `.dim_*` imageUrl paths that match the existing generated filenames in `frontend/public/assets/generated/`.",
        "On canister upgrade, existing persisted records for the affected menu items are updated to the corrected `.dim_*` URLs even if they previously had older/legacy values.",
        "After upgrade, Dosa uses the dosa image asset; other affected items use their corresponding non-dosa assets."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Ensure the dosa menu item image itself is high-quality and visually correct by updating the existing generated dosa asset, and ensure all occurrences of the dosa image in the UI correspond to the Dosa dish only.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "remove the dosa images from the menu items and replace with the perfect images all over the application"
        ]
      },
      "acceptanceCriteria": [
        "`dish-dosa.dim_512x512.png` is updated to a clearer, more appetizing dosa image (still visually a dosa).",
        "No non-dosa menu item displays `dish-dosa.dim_512x512.png` anywhere in the application UI flows (restaurants list/detail, cart, order list/detail)."
      ]
    }
  ],
  "constraints": [
    "Frontend files listed as immutable in SYSTEM_CONTEXT must not be edited (compose instead).",
    "Backend must remain a single-actor Motoko canister with all logic in `backend/main.mo`; add `backend/migration.mo` only as needed for upgrade state corrections."
  ],
  "nonGoals": [
    "Generating bespoke new images for every single seeded dish across all cuisines (beyond the generic fallback and dosa edit) unless explicitly requested.",
    "Adding new restaurants, menu items, or changing pricing/descriptions unrelated to image correctness."
  ],
  "imageRequirements": {
    "required": [
      "Generic plated-food placeholder image (dish-generic.dim_512x512.png)"
    ],
    "edits": [
      "Replace the dosa dish image with a higher-quality, more appetizing dosa photo (dish-dosa.dim_512x512.png > dish-dosa.dim_512x512.png)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}