{
  "kind": "build_request",
  "title": "Online Food Ordering System: Auth, Restaurant/Menu Browsing, Order Placement & Tracking",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement user authentication using Internet Identity, and provide a basic user profile record in the backend that is created/updated on first login (keyed by the caller Principal).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "User registration & login"
        ]
      },
      "acceptanceCriteria": [
        "Users can sign in and sign out via Internet Identity in the frontend UI.",
        "On first successful sign-in, the backend stores a user profile linked to the authenticated Principal.",
        "Authenticated calls (e.g., placing an order, listing a user's orders) use the caller identity and do not require manual user ID entry."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Design and implement backend data models that reflect normalized (1NF–3NF) entities for an online food ordering domain, using explicit IDs and references to represent primary/foreign keys and one-to-many relationships: Restaurant -> MenuItem (one-to-many) and User -> Order (one-to-many), with Order -> OrderItem (one-to-many).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Browse restaurants and menus",
          "Place and track orders",
          "Primary & foreign keys",
          "One-to-many relationships",
          "Basic normalization (1NF–3NF)"
        ]
      },
      "acceptanceCriteria": [
        "Backend defines distinct record types for Restaurant, MenuItem, Order, and OrderItem, each with stable unique identifiers.",
        "Menu items reference their owning restaurant by ID (foreign-key-like reference), and order items reference both an order ID and a menu item ID.",
        "Order records reference the owning user (Principal) and do not embed redundant restaurant/menu item data beyond what is required for ordering."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Provide backend query APIs to browse restaurants and their menus, including: list restaurants, get restaurant details, and list menu items for a restaurant.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Browse restaurants and menus"
        ]
      },
      "acceptanceCriteria": [
        "Frontend displays a restaurant list view populated from the backend.",
        "Selecting a restaurant shows its details and menu items fetched from the backend.",
        "APIs are read-only for end users (no admin creation UI required unless explicitly added later)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement order placement end-to-end: users can add menu items to a cart, specify quantities, submit an order, and the backend persists the order and order items linked to the authenticated user.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Place and track orders"
        ]
      },
      "acceptanceCriteria": [
        "Frontend supports adding/removing items and adjusting quantities in a cart before checkout.",
        "Submitting an order creates a new Order and associated OrderItem records in the backend.",
        "Only authenticated users can place orders; unauthenticated users are prompted to sign in."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Implement order tracking: define an order status lifecycle (e.g., Pending, Confirmed, Preparing, OutForDelivery, Delivered, Cancelled) and provide backend APIs and frontend UI to view a user's orders and track each order’s current status and history/timestamps.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Place and track orders"
        ]
      },
      "acceptanceCriteria": [
        "Users can view a list of their orders (most recent first) and open an order detail view.",
        "Order detail shows status and relevant timestamps (at least created time; optionally status update times).",
        "Backend prevents users from reading other users' orders."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Seed the backend with a small set of sample restaurants and menu items so the app is usable immediately after deployment without requiring an admin UI.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Browse restaurants and menus"
        ]
      },
      "acceptanceCriteria": [
        "At least 3 restaurants exist with at least 5 menu items each after initial deployment.",
        "Seed data is deterministic and does not duplicate on subsequent canister upgrades/redeployments."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Create a coherent frontend UI for the core flows (sign in, browse restaurants, view menu, cart/checkout, orders list, order detail) using React + TypeScript, Tailwind, shadcn/ui components, and React Query for data fetching/caching.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "User registration & login",
          "Browse restaurants and menus",
          "Place and track orders"
        ]
      },
      "acceptanceCriteria": [
        "All user-facing text is in English.",
        "Data-fetching views use React Query for loading/error states and caching.",
        "Navigation between major views is clear and consistent (restaurants -> menu -> cart -> order confirmation; orders -> order detail)."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Apply a distinct, consistent visual theme across the frontend (colors, typography, spacing, and component styling) appropriate for a food ordering app; do not use a blue-and-purple primary palette unless explicitly requested.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "The UI uses a consistent design system (primary/secondary colors, typography scale, button/input styles) across all screens.",
        "The chosen palette is not predominantly blue-and-purple."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Use Internet Identity for authentication; do not add third-party auth providers.",
    "Do not modify files under frontend/src/components/ui or other frontend immutablePaths; compose these components instead."
  ],
  "nonGoals": [
    "Restaurant onboarding/admin dashboard for managing restaurants and menu items.",
    "Payments processing and checkout integrations.",
    "Real-time order updates via WebSockets/push notifications (polling or manual refresh is acceptable).",
    "Delivery driver dispatching, mapping, or GPS tracking."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}