{
  "kind": "build_request",
  "title": "Generate and wire correct images for Sakthi Snacks items (Jalebi, Veg Frankie Roll, Veg Momos, Veg Sandwich)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Generate new, correct dish images (without user uploads) for Sakthi Snacks menu items: Jalebi, Vegetable Frankie Roll, Vegetable Momos, and Vegetable Sandwich, and add them as static assets under `frontend/public/assets/generated/` using the filenames specified in the Image Requirements.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "change the image of jilebi and generate by yourself",
          "generate images y yourself"
        ]
      },
      "acceptanceCriteria": [
        "The following image files exist under `frontend/public/assets/generated/` and render correctly in a browser: `dish-sakthi-jalebi.dim_512x512.png`, `dish-sakthi-vegetable-frankie-roll.dim_512x512.png`, `dish-sakthi-vegetable-momos.dim_512x512.png`, `dish-sakthi-vegetable-sandwich.dim_512x512.png`.",
        "Each generated image visually matches the dish implied by its filename (Jalebi is a syrupy spiral dessert; momos are steamed dumplings; frankie roll is a wrap/roll; vegetable sandwich is a layered sandwich)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update `frontend/src/utils/imageFallbacks.ts` so the dish-name mapping resolves these Sakthi Snacks items to the newly generated dish assets: `jalebi`, `vegetable frankie roll`, `vegetable momos` (including the existing `vegetable momos (6 pcs)` normalized key), and `vegetable sandwich`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "change the image of jilebi and generate by yourself",
          "generate images y yourself"
        ]
      },
      "acceptanceCriteria": [
        "In `frontend/src/utils/imageFallbacks.ts`, the `DISH_NAME_TO_IMAGE` entries for `jalebi`, `vegetable frankie roll`, `vegetable momos`, `vegetable momos (6 pcs)`, and `vegetable sandwich` point to the new `/assets/generated/dish-sakthi-*.dim_512x512.png` paths.",
        "When `getDishImageUrl` is called with an empty/legacy `imageUrl` and a matching dish name, it returns the new Sakthi image path rather than the generic dish fallback."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the seeded Sakthi Snacks (restaurantId = 7) menu items in `backend/main.mo` so their `imageUrl` values for Jalebi, Vegetable Frankie Roll, Vegetable Momos, and Vegetable Sandwich correspond to the new generated static assets under `/assets/generated/` (or are set to an empty string so the frontend name-based mapping resolves to the correct new images).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "change the image of jilebi and generate by yourself",
          "generate images y yourself"
        ]
      },
      "acceptanceCriteria": [
        "`backend/main.mo` no longer seeds legacy/mismatched `imageUrl` values for Sakthi Snacks items: Jalebi, Vegetable Frankie Roll, Vegetable Momos, Vegetable Sandwich.",
        "After loading the Restaurants list and Sakthi Snacks restaurant detail page, these four menu items display the newly generated images (either via direct `imageUrl` or via name-based mapping when `imageUrl` is empty/legacy)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not edit files under `frontend/src/components/ui` or the immutable hook entrypoints listed in SYSTEM_CONTEXT.",
    "Store generated images as static assets under `frontend/public/assets/generated/` and reference them via `/assets/generated/...` paths (do not serve images via the backend)."
  ],
  "nonGoals": [
    "Do not change authentication (Internet Identity) behavior.",
    "Do not redesign other restaurants’ menus or images beyond the four specified Sakthi Snacks items.",
    "Do not add real-time features, external databases, or third-party auth providers."
  ],
  "imageRequirements": {
    "required": [
      "Close-up studio photo of bright orange jalebi spirals soaked in sugar syrup, on a small plate, high detail (dish-sakthi-jalebi.dim_512x512.png)",
      "Close-up studio photo of a vegetable frankie roll/wrap (flatbread roll) sliced to show filling, with chutney, high detail (dish-sakthi-vegetable-frankie-roll.dim_512x512.png)",
      "Close-up studio photo of steamed vegetable momos/dumplings arranged on a plate with dipping sauce, high detail (dish-sakthi-vegetable-momos.dim_512x512.png)",
      "Close-up studio photo of a fresh vegetable sandwich with visible layers (tomato, cucumber, lettuce), on a plate, high detail (dish-sakthi-vegetable-sandwich.dim_512x512.png)"
    ],
    "edits": []
  }
}