{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stabilize restaurant detail navigation and error handling",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Harden restaurants list -> restaurant detail navigation and detail page ID parsing/query error handling to avoid runtime crashes and show friendly error UI for invalid IDs.",
      "acceptanceCriteria": [
        "From the Restaurants list page, clicking any restaurant card navigates to `/restaurants/<id>` and the page renders without a blank screen or uncaught exception.",
        "The Restaurant Detail page shows a user-friendly error UI (not a crash) when the URL contains an invalid restaurantId (empty, non-numeric, or negative).",
        "If fetching restaurant or menu data fails, the existing error UI is shown (via `ErrorState`) and the Back button still works.",
        "No invalid restaurant entries (missing `id`) are clickable in the list; they are safely skipped as already intended."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/restaurantId.ts",
          "operation": "create",
          "description": "Add a small shared helper to validate and parse `restaurantId` route params into a positive bigint (returning a typed result that includes an error message for invalid/empty/non-numeric/negative values) so both list/detail flows handle IDs consistently."
        },
        {
          "path": "frontend/src/utils/getErrorMessage.ts",
          "operation": "create",
          "description": "Add a utility to safely convert unknown thrown values (including non-Error shapes from query libraries) into a user-friendly string for `ErrorState`, avoiding runtime errors from accessing `.message` on non-Error values."
        },
        {
          "path": "frontend/src/pages/RestaurantsListPage.tsx",
          "operation": "modify",
          "description": "Ensure only valid restaurants are clickable by validating `restaurant.id` before rendering a clickable Card; use the shared `restaurantId` helper to build the route param string; and use `getErrorMessage` when rendering `ErrorState` to prevent crashes if `error` is not an `Error` object."
        },
        {
          "path": "frontend/src/pages/RestaurantDetailPage.tsx",
          "operation": "modify",
          "description": "Replace inline `restaurantId` parsing with the shared `restaurantId` helper; ensure queries are always invoked with a safe value while being disabled for invalid IDs; and use `getErrorMessage` for `ErrorState` to prevent runtime errors while preserving the Back button behavior."
        },
        {
          "path": "frontend/src/hooks/useRestaurant.ts",
          "operation": "modify",
          "description": "Make `useGetRestaurant`/`useGetRestaurantMenu` resilient to invalid IDs by allowing a nullable/invalid input pattern (while keeping React hook call sites stable) and ensuring queries stay disabled for non-positive IDs; keep return values (`null`/`[]`) consistent so the detail page can render empty/not-found/error states without crashing."
        }
      ]
    }
  ]
}